lib/profile_information/fetch_info.rb

SELECT "roles".* FROM "roles" WHERE "roles"."name" = $1 LIMIT $2  [["name", "Employee"], ["LIMIT", 1]]
INSERT INTO "employee_details" ("first_name", "last_name", "city", "email", "designation", "image", "created_at", "updated_at", "role_id", "mobile_no") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
SELECT "employee_details".* FROM "employee_details" WHERE "employee_details"."first_name" = $1 AND "employee_details"."last_name" = $2 AND "employee_details"."email" = $3 ORDER BY "employee_details"."id" ASC LIMIT $4  [["first_name", "Rakshit"], ["last_name", "Khandelwal"], ["email", "rakshit1505@gmail.com"], ["LIMIT", 1]]
---
      email =  doc.css(:xpath,"//a[@class='pv-contact-info__contact-link link-without-visited-state t-14']")&.text&.split[1] || "#{name&.split[0]&.downcase}.#{name&.split[1]&.downcase}@protonshub.in"
      p "email=#{email}"
      payload = {
        first_name: name&.split()[0],
        last_name: name&.split()[1],
        city: city,
        # description: description,
        email:email,
        mobile_no:mobile,
        designation: designation,
        image: image,
        role_id:Role.find_by(name:'Founder').id
      }
      p "payoad = #{payload}"

      @company.employee_details.create!(payload) unless @company.employee_details.where(first_name:payload[:first_name], last_name:payload[:last_name], email:payload[:email]).first.present?

SELECT "roles".* FROM "roles" WHERE "roles"."name" = $1 LIMIT $2  [["name", "Employee"], ["LIMIT", 1]]
INSERT INTO "employee_details" ("first_name", "last_name", "city", "email", "designation", "image", "created_at", "updated_at", "role_id", "mobile_no", "company_detail_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
SELECT "employee_details".* FROM "employee_details" WHERE "employee_details"."first_name" = $1 AND "employee_details"."last_name" = $2 AND "employee_details"."email" = $3 ORDER BY "employee_details"."id" ASC LIMIT $4  [["first_name", "Shabnam Mansoori"], ["last_name", "Shabnam Mansoori"], ["email", "shabnam.mansoori@protonshub.in"], ["LIMIT", 1]]
---
      email =  doc.css(:xpath,"//a[@class='pv-contact-info__contact-link link-without-visited-state t-14']")&.text&.split[1] || "#{name&.split[0]&.downcase}.#{name&.split[1]&.downcase}@protonshub.in"
      p "email=#{email}"
      payload = {
        first_name: name&.split()[0],
        last_name: name&.split()[1],
        city: city,
        # description: description,
        email:email,
        mobile_no:mobile,
        designation: designation,
        image: image,
        role_id:Role.find_by(name:'Employee')&.id
      }
      p "payoad = #{payload}"

      @company.employee_details.create!(payload) unless @company.employee_details.where(first_name:payload[:first_name], last_name:payload[:last_name], email:payload[:email]).first.present?