lib/profile_information/fetch_info.rb

        p "email=#{email}"

        payload = {
          first_name: name&.split()[0],
          last_name: name&.split()[1],
          city: city,
          # description: description,
          email:email,
          mobile_no:mobile,
          designation: designation,
          image: image,
          # role_id:Role.find_by(name:'Founder').id
---
SELECT "roles".* FROM "roles" WHERE "roles"."name" = $1 LIMIT $2  [["name", "Employee"], ["LIMIT", 1]]


        p "payoad = #{payload}"

        detail = @company.employee_details.where(first_name:payload[:first_name], last_name:payload[:last_name], email:payload[:email]).first

        unless detail.present?
          @company.employee_details.create!(payload)
---
SELECT "employee_details".* FROM "employee_details" WHERE "employee_details"."first_name" = $1 AND "employee_details"."last_name" = $2 AND "employee_details"."email" = $3 ORDER BY "employee_details"."id" ASC LIMIT $4  [["first_name", "Shabnam Mansoori"], ["last_name", "Shabnam Mansoori"], ["email", "shabnam.mansoori@protonshub.in"], ["LIMIT", 1]]
INSERT INTO "employee_details" ("first_name", "last_name", "city", "description", "email", "designation", "image", "created_at", "updated_at", "role_id", "mobile_no") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"