app/controllers/api/v1/users/sessions_controller.rb

  def create
    user = User.find_by(email:params[:user][:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "new_user@test.com"], ["LIMIT", 1]]