app/controllers/api/v1/linked_data_controller.rb

  def resync
    begin
      name = params[:company_name]
      profile = params[:url]+"/people"
      company = CompanyDetail.find_or_create_by(name:name)
---
INSERT INTO "company_details" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2021-10-26 06:37:02.938039"], ["updated_at", "2021-10-26 06:37:02.938039"]]
SELECT "company_details".* FROM "company_details" WHERE "company_details"."name" = $1 LIMIT $2  [["name", "Protonshub Technologies"], ["LIMIT", 1]]

  def export_csv
    name = params[:company_name]
    url = params[:url]
    company = CompanyDetail.find_by(name:name,url:url)
---
SELECT "company_details".* FROM "company_details" WHERE "company_details"."name" = $1 AND "company_details"."url" = $2 LIMIT $3  [["name", "Protonshub Technologies"], ["url", "https://www.linkedin.com/company/protonshub-technologies"], ["LIMIT", 1]]

  def search
    #name, city, designation
    company = CompanyDetail.find_by(name:params[:company_name])
    if company.present?
---
SELECT "company_details".* FROM "company_details" WHERE "company_details"."name" = $1 LIMIT $2  [["name", "Protonshub Technologies"], ["LIMIT", 1]]

  def company_info
    begin
      company = CompanyDetail.find_by(name:params[:company_name], url:params[:url])
---
SELECT "company_details".* FROM "company_details" WHERE "company_details"."name" = $1 AND "company_details"."url" = $2 LIMIT $3  [["name", "Protonshub Technologies"], ["url", "https://www.linkedin.com/company/protonshub-technologies"], ["LIMIT", 1]]