app/controllers/api/v1/linked_data_controller.rb

UPDATE "company_details" SET "name" = $1, "tagline" = $2, "description" = $3, "city" = $4, "followers" = $5, "no_of_employees" = $6, "logo" = $7, "founders_count" = $8, "updated_at" = $9 WHERE "company_details"."id" = $10
---
        begin
          options = Selenium::WebDriver::Firefox::Options.new(args:['-headless'])
          driver = Selenium::WebDriver.for(:firefox, options: options)
          ExceptionDetail.first.update(ex_status:"Running", company_detail_id:company.id)