app/controllers/api/v1/registrations_controller.rb

  def create
    build_resource(sign_up_params)
    if User.find_by_email(resource.email)
      render json: { message: "This user is already present",success: false }, status: 422
      return
    else
      resource.save
      return render json:{message: resource.errors.full_messages.join(" and "),success: false }, status:422 if resource.errors.present?
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "po12w9i22@yopmail.com"], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = $1, "sign_in_count" = $2, "current_sign_in_at" = $3, "last_sign_in_at" = $4, "current_sign_in_ip" = $5, "last_sign_in_ip" = $6 WHERE "users"."id" = $7
SELECT 1 AS one FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "po12w9i22@yopmail.com"], ["LIMIT", 1]]

  def change_password
    # if params['password'].present? && !current_user.valid_password?(params['old_password'])
    #             # render json: {success: true, message: "User updated successfully", user: user_format,status: 200}

    #   render json: {message: 'Old_password Does not match',success: false,user: user_format,status: 200}
    # else
    unless current_user
      render json: {message: 'Invalid Credentials',success: false}
    else
    binding.pry
      current_user.update(password: params[:update_password])
---
UPDATE "users" SET "encrypted_password" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["encrypted_password", "$2a$11$1p35fWw/2pe7PjEzr4vB1uqgo0BM4G1Q4H6oUUJ67ezbXEo0TifV."], ["updated_at", "2021-10-21 08:28:31.125258"], ["id", 64]]