app/controllers/api/v1/sessions_controller.rb

    def create
      user = User.find_by(email:params[:user][:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "latest_test@yopmail.com"], ["LIMIT", 1]]