app/models/employee_detail.rb

SELECT "roles".* FROM "roles" WHERE "roles"."name" = $1 LIMIT $2  [["name", "Founder"], ["LIMIT", 1]]
---
  def self.founders_data
    where(role:Role.find_by(name:"Founder"))

SELECT "roles".* FROM "roles" WHERE "roles"."name" = $1 LIMIT $2  [["name", "Employee"], ["LIMIT", 1]]
---
  def self.employees_data
    where(role:Role.find_by(name:"Employee"))